In [3]:
import pandas as pd
df1 = pd.read_csv("customer_interactions.csv")
df1.head(5)

   customer_id  page_views  time_spent
0            1          25         120
1            2          20          90
2            3          30         150
3            4          15          80
4            5          22         110

In [19]:
df2 = pd.read_csv("product_details.csv", delimiter=";")
df2.head(5)
df_cleaned = df2.iloc[:, :4]

,product_id,category,price,ratings,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,101,Electronics,500,4.5,NaN,NaN,NaN
1,102,Clothing,50,3.8,NaN,NaN,NaN
2,103,Home & Kitchen,200,4.2,NaN,NaN,NaN
3,104,Beauty,30,4.0,NaN,NaN,NaN
4,105,Electronics,800,4.8,NaN,NaN,NaN

In [8]:
df3= pd.read_csv("purchase_history.csv", delimiter=";")
df3.dropna()
df3.head(5)

,customer_id,product_id,purchase_date,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,1,101,2023-01-01,NaN,NaN,NaN,NaN
1,1,105,2023-01-05,NaN,NaN,NaN,NaN
2,2,102,2023-01-02,NaN,NaN,NaN,NaN
3,3,103,2023-01-03,NaN,NaN,NaN,NaN
4,4,104,2023-01-04,NaN,NaN,NaN,NaN

In [25]:
df_merge= pd.merge(df1, df3.iloc[:, :3], on='customer_id', how='inner')  # Menggabungkan df1 dan df2
#df_merge = pd.merge(df_merge, df3, on='product_id', how='inner')
df_merge = pd.merge(df_merge, df2.iloc[:, :4], on='product_id', how='inner')
df_merge
selected_columns = ['product_id', 'category', 'price', 'ratings']
selected_df = df_merge[selected_columns]
selected_df
#df_merge.values.argsort()[-3:][::-1]

   product_id        category  price  ratings
0         101     Electronics    500      4.5
1         101     Electronics    500      4.5
2         105     Electronics    800      4.8
3         102        Clothing     50      3.8
4         103  Home & Kitchen    200      4.2
5         104          Beauty     30      4.0